'''
1，简述变量命名的规范
    （1）分别由数字，字母，下划线组成，并且不能以数字开头
    （2）不能使用python中的关键词命名
'''
'''
2，字节与位的关系（不会）
    8位(bit)表示一个字节(byte)
    1024字节表示1kb
    1024kb表示1mb
    1024mg表示1gb
    0100 0001   表示A
    0100 0010   表示B
    0100 0011   表示C
'''
'''
3，'二哥'使用utf-8编码的时候，占的位数和字节数是多少？使用gbk编码时，占的位数和字节数是多少？
'''
'''
8,lis = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 'ab']]]
    （1）将列表lis中的'tt'变成大写（用两种方式）
    （2）将列表中的数字3变成字符串'100'（用两种方式）
    （3）将列表中的字符串'1'变成数字101（两种方式）
'''
# (1)
lis = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 'ab']]]
lis[0][1][2]['k1'][0] = 'TT'
print(lis)
# [['k', ['qwe', 20, {'k1': ['TT', 3, '1']}, 'ab']]]

# (2)
lis = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 'ab']]]
lis[0][1][2]['k1'][1] = '100'
print(lis)
# [['k', ['qwe', 20, {'k1': ['tt', '100', '1']}, 'ab']]]

# (3)
lis = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 'ab']]]
lis[0][1][2]['k1'][2] = 101
print(lis)
# [['k', ['qwe', 20, {'k1': ['tt', 3, 101]}, 'ab']]]


